docs/fieldslectures.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-03 Sun 11:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Fields lectures</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
<p style="display:none"> \(\newcommand{\threepartdef}[6]{\left\{\begin{array}{lll} #1 & \mbox{if } #2 \\ #3 & \mbox{if } #4 \\ #5 & \mbox{if } #6 \end{array} \right.}\) </p>
<p style="display:none"> \(\newcommand{\twopartdef}[4]{\left\{\begin{array}{ll} #1 & \mbox{if } #2 \\ #3 & \mbox{if } #4 \end{array} \right.}\) </p>
</head>
<body>
<div id="content">
<h1 class="title">Fields lectures</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb68ea60">[May 16] Michael Shulman: synthetic homotopy theory</a>
<ul>
<li><a href="#org8a1d8ab">Introduction: type theory</a></li>
<li><a href="#org74a404d">Identity types</a>
<ul>
<li><a href="#orgfc32627">Why does this work? How can exist non-trivial paths?</a></li>
<li><a href="#org5ab945b">Homotopy structure</a></li>
</ul>
</li>
<li><a href="#org699e821">Observational/definitional/cubicaal approach</a></li>
<li><a href="#org4cdd55c">n-types &amp; propositions</a>
<ul>
<li><a href="#orgc0e204f">Propositional truncation</a></li>
</ul>
</li>
<li><a href="#org619eaac">Synthetic homotopy theory</a>
<ul>
<li><a href="#org1171994">Traditional vs synthetic</a></li>
</ul>
</li>
<li><a href="#org5281a56">Our tools: HITs and univalence</a></li>
</ul>
</li>
<li><a href="#orgc1fce1f">[May 19] Thorsten Altenkirch: why does homotopy type theory matter?</a>
<ul>
<li><a href="#orgf75baeb">What has homotopy theory ever done for us?</a></li>
<li><a href="#org9f5db0c">Setoids</a></li>
<li><a href="#orgb6b2dd0"><span class="todo TODO">TODO</span> Setoid interpretation</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="http://www.fields.utoronto.ca/video-archive//event/2012/2016">http://www.fields.utoronto.ca/video-archive//event/2012/2016</a>
</p>

<div id="outline-container-orgb68ea60" class="outline-2">
<h2 id="orgb68ea60">[May 16] Michael Shulman: synthetic homotopy theory</h2>
<div class="outline-text-2" id="text-orgb68ea60">
<p>
It shows a proof of the equality between integers and the foundamental
group of the circle.
</p>
</div>

<div id="outline-container-org8a1d8ab" class="outline-3">
<h3 id="org8a1d8ab">Introduction: type theory</h3>
<div class="outline-text-3" id="text-org8a1d8ab">
<p>
Homotopy type theory is a variation on ML-TT with Higher inductive
types and univalence. In type theory we have
</p>

<ul class="org-ul">
<li>types,</li>
<li>terms,</li>
<li>type constructors, like Pi or Sigma,</li>
<li>several universes</li>
</ul>

<p>
From the homotopic point of view, we think of types as spaces or
groupoids. A type family is a homotopy-theoretic fibration: if
we have \(B : A \to {\cal U}\), \(B(x)\) is the fiber over \(x : A\).
</p>
</div>
</div>

<div id="outline-container-org74a404d" class="outline-3">
<h3 id="org74a404d">Identity types</h3>
<div class="outline-text-3" id="text-org74a404d">
<p>
Identity types provide the groupoid structure to a type. Equalities
are paths between two points of a type.
</p>

<ul class="org-ul">
<li>Leibniz/Lawvere/Martin-Lof notion. The family of equality types for
any given type is freely generated by the reflexivity path.</li>
</ul>
</div>

<div id="outline-container-orgfc32627" class="outline-4">
<h4 id="orgfc32627">Why does this work? How can exist non-trivial paths?</h4>
<div class="outline-text-4" id="text-orgfc32627">
<p>
The space of paths with a fixed endpoint is contractible. There are no
paths but reflexivity. Every path can be retracted back to
reflexivity.  You can use the Yoneda lemma here; the hom functor is
determined by the identity map.
</p>
</div>
</div>

<div id="outline-container-org5ab945b" class="outline-4">
<h4 id="org5ab945b">Homotopy structure</h4>
<div class="outline-text-4" id="text-org5ab945b">
<p>
Any type has an internal homotopy structure
</p>
</div>
</div>
</div>

<div id="outline-container-org699e821" class="outline-3">
<h3 id="org699e821">Observational/definitional/cubicaal approach</h3>
<div class="outline-text-3" id="text-org699e821">
<p>
The meaning of the identity type is defined recursively on the
structure of the type A. For example, if we have a product type,
two pairs are equal if their components are equal.
</p>

<p>
We have operations of transport defined in terms of the structure of
the type.
</p>
</div>
</div>

<div id="outline-container-org4cdd55c" class="outline-3">
<h3 id="org4cdd55c">n-types &amp; propositions</h3>
<div class="outline-text-3" id="text-org4cdd55c">
<p>
We regard types as representing propositions, things that we can prove;
and elements of a type are their proofs.
</p>

<ul class="org-ul">
<li>A type is a proposition if every two elements of that type are
propositionally equal.</li>
</ul>

<p>
Note that propositional equalities have nothing to do with these mere
propositions.
</p>
</div>

<div id="outline-container-orgc0e204f" class="outline-4">
<h4 id="orgc0e204f">Propositional truncation</h4>
<div class="outline-text-4" id="text-orgc0e204f">
<p>
A type such that every map from a type factors uniquely throught its
propositional truncation.
</p>
</div>
</div>
</div>
<div id="outline-container-org619eaac" class="outline-3">
<h3 id="org619eaac">Synthetic homotopy theory</h3>
<div class="outline-text-3" id="text-org619eaac">
<p>
Synthetic homotopy theory is the study in HoTT of properties of types
that traditionally belong to homotopy spaces. We view types as spaces
and we try to apply ideas from homotopy theory.
</p>

<p>
For example, we classically define the homotopy group of a space as a
map from the sphere to a space.
</p>

<p>
We can define the loop space of a type. If we iterate over this, we get
higher homotopy groups. The zero truncation of these types gives us the
homotopy paths.
</p>
</div>

<div id="outline-container-org1171994" class="outline-4">
<h4 id="org1171994">Traditional vs synthetic</h4>
<div class="outline-text-4" id="text-org1171994">
<p>
Traditional
</p>

<ul class="org-ul">
<li>spaces are sets of points,</li>
</ul>

<p>
Synthetic
</p>

<ul class="org-ul">
<li>spaces are fundamental notions,</li>
<li>paths are fundamental notions.</li>
</ul>

<p>
Synthetic homotopy theory models other homotopy theories, things like
higher toposes are expected to be models of this theory.
</p>
</div>
</div>
</div>

<div id="outline-container-org5281a56" class="outline-3">
<h3 id="org5281a56">Our tools: HITs and univalence</h3>
<div class="outline-text-3" id="text-org5281a56">
<p>
HITs give us a way to construct spaces in type theory.
</p>

<p>
In classical homotopy theory we have cell-complexes and we use them to
build complicated spaces. A higher inductive is a cell-complex what an
inductive type is a 0-dimensional cell-complex.
</p>

<p>
The circle can be constructed directly as a HIT.
</p>

<p>
We can prove that
\[
\Omega(\mathbb{S}^1, \mathrm{base}) = \mathbb{Z},
\]
by defining a map from the integers to the paths, \(n \mapsto \mathrm{loop}^n\).
</p>

<p>
We need the UA in order to create the converse function.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc1fce1f" class="outline-2">
<h2 id="orgc1fce1f">[May 19] Thorsten Altenkirch: why does homotopy type theory matter?</h2>
<div class="outline-text-2" id="text-orgc1fce1f">
<ul class="org-ul">
<li><b>Realist</b> foundation of mathematics. Mathematical objects are real
things instead of constructed notions. We use sets.</li>

<li><b>Constructivist</b> foundation of mathematics. We are not basing this
in real objects, we are only communicating ideas. Type theory can be
thought of as an implementation of constructivism.

<ul class="org-ul">
<li>We can reason about propositions.</li>
<li>We use types instead of sets.</li>
</ul></li>
</ul>

<p>
We can translate propositions as types, and this is not a sintactic
trick but a new way of understanding a proposition. If we use types
instead of sets, we have to introduce types and terms from that type
at the same time. There is no way to reference untyped objects.
</p>

<p>
\[
\mathtt{Bool} \cong \mathtt{Prop},
\]
</p>

<p>
if and only if the LEM holds.
</p>
</div>

<div id="outline-container-orgf75baeb" class="outline-3">
<h3 id="orgf75baeb">What has homotopy theory ever done for us?</h3>
<div class="outline-text-3" id="text-orgf75baeb">
<p>
In Martin-Löf first version, membership was impredicative. Then he
introduced extensional type theory; and then later he introduced
intensional type theory.
</p>

<ul class="org-ul">
<li>Programming in Martin-Lof's type theory, Nordström.</li>
</ul>

<p>
In intensional type theory, two objects are equal only if they are
defined the same way; that is a problem. These two functions
</p>

<ul class="org-ul">
<li>\(\lambda x.x + 0\),</li>
<li>\(\lambda x.0+x\),</li>
</ul>

<p>
for example, are not equal.
</p>
</div>
</div>

<div id="outline-container-org9f5db0c" class="outline-3">
<h3 id="org9f5db0c">Setoids</h3>
<div class="outline-text-3" id="text-org9f5db0c">
<p>
Setoids are a way to solve the problem with intensional type theory.
A setoid is a type with some equivalence relation. From any two
setoids \(A,B\), we can define a new setoid \(A \to B\) whose functions
must preserve the equivalence relation. That is, we can translate the
usual type constructors into setoid constructors.
</p>
</div>
</div>

<div id="outline-container-orgb6b2dd0" class="outline-3">
<h3 id="orgb6b2dd0"><span class="todo TODO">TODO</span> Setoid interpretation</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mario Román</p>
<p class="date">Created: 2017-12-03 Sun 11:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
